p_pipeFlowAnalysis/pimpleFoamPipe/RANS/kOmegaSST/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    bottomPatch
    {
        type            turbulentMixingLengthFrequencyInlet;
	mixingLength	0.07;
	value		$internalField;
    }
}


// ************************************************************************* //
